app/controllers/songs_controller.rb

  def index
  	@song = Song.all
---
SELECT "songs".* FROM "songs"

  def new
  	@song = Song.new
  	@song_list = Song.all
---
SELECT "songs".* FROM "songs"

  def create
  	@song = Song.new(params[:song])

  	if @song.save
---
INSERT INTO "songs" ("album", "artist", "asset_content_type", "asset_file_name", "asset_file_size", "asset_updated_at", "cover", "cover_content_type", "cover_file_name", "cover_file_size", "cover_updated_at", "created_at", "file", "genre", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @song = Song.find(params[:id])
    @song_list = Song.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "songs".* FROM "songs"

  def edit
    @song = Song.find(params[:id])
    @song_list = Song.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "songs".* FROM "songs"

  def update
    @song = Song.find(params[:id])
    if @song.update_attributes(params[:song])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "songs" SET "asset_file_name" = 'evanescence', "asset_content_type" = 'application/octet-stream', "asset_file_size" = 7985, "asset_updated_at" = '2012-12-05 17:07:04.975709', "updated_at" = '2012-12-05 17:07:04.977209' WHERE "songs"."id" = 1

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 2]]